app/views/statuses/index.html.erb

                      <b class = "numri">
                      <%if Formulari.where(status_id: 1).count>0%>
---
SELECT "formularis".* FROM "formularis" WHERE "formularis"."status_id" = ?  [["status_id", 1]]
SELECT COUNT(*) FROM "formularis" WHERE "formularis"."status_id" = ?  [["status_id", 1]]