app/views/interviews/index.html.erb

SELECT "formularis".* FROM "formularis" WHERE "formularis"."status_id" = ?  [["status_id", 4]]
---
        <ul class="dropdown-menu alert-dropdown">
        <%Formulari.where(status_id: 4).each do |f|%>