app/views/pozita/zgjidh.html.erb

SELECT "pozis".* FROM "pozis"
---
          <p><select name="pozita">
             <% pozita = Pozi.all%>