app/views/refuzuars/index.html.erb

SELECT "formularis".* FROM "formularis" WHERE "formularis"."status_id" = ?  [["status_id", 3]]
SELECT COUNT(*) FROM "formularis" WHERE "formularis"."status_id" = ?  [["status_id", 3]]
---
          <b class = "numri">
          <%if Formulari.where(status_id: 3).count>0%>