app/views/formularis/edit.html.erb

          <b class = "numri">
          <%if Formulari.where(status_id: 1).count>0%>
---
SELECT "formularis".* FROM "formularis" WHERE "formularis"."status_id" = ?  [["status_id", 1]]
SELECT COUNT(*) FROM "formularis" WHERE "formularis"."status_id" = ?  [["status_id", 1]]


                                                    <div class="col-md-8"><%= f.collection_select(:status_id, Status.all, :id, :description,prompt: true)%></div>
---
SELECT "statuses".* FROM "statuses"