app/views/formularis/index.html.erb

                        <div class="col-sm-10">
                          <%= f.collection_select(:pozi_id, Pozi.all, :id, :description,prompt: true, class: "form-control p_s",placeholder: "Zgjidh poziten")%>
---
SELECT "pozis".* FROM "pozis"

                        <div class="col-sm-10">
                          <%= f.collection_select(:qytetet_id, Qytetet.all, :id, :description,prompt: true, class: "form-control p_s",placeholder: "Zgjidh Vendlindjen")%>
---
SELECT "qytetets".* FROM "qytetets"

                        <div class="col-sm-10">
                          <%= f.collection_select(:gjuha_id, Gjuha.all, :id, :description,prompt: true, class: "form-control p_s",placeholder: "Zgjidh Gjuhen")%>
---
SELECT "gjuhas".* FROM "gjuhas"