app/controllers/apliko_controller.rb

  def pune
    @pozita = Pozi.find(params['pozita'])
---
SELECT  "pozis".* FROM "pozis" WHERE "pozis"."id" = ? LIMIT 1  [["id", 1]]