app/controllers/dashboard_controller.rb

UPDATE "kontrata" SET "pk" = ?, "updated_at" = ? WHERE "kontrata"."id" = ?  [["pk", 1], ["updated_at", "2016-06-01 12:32:20.050993"], ["id", 1]]
---
  def new
		@kontr = Kontratum.all
		@kontr.each do |k|
			if (k.kontrata_deri - Time.now.to_date).to_i <= 7 && k.pk == 0
				KontratumMailer.notifikimi_per_kontrata(k.emri,k.mbiemri,k.kontrata_deri,k.email).deliver
				k.update(:pk => 1)