app/controllers/formularis_controller.rb

  def index
    @forms = Formulari.all
    ab(params[:lan])
    @pcs = Pc.all
    @gjuhas = Gjuha.all
    @status = Status.all
    @qytetets = Qytetet.all
    @pozi = Pozi.all
---
SELECT "formularis".* FROM "formularis"
SELECT "gjuhas".* FROM "gjuhas"
SELECT "statuses".* FROM "statuses"
SELECT "qytetets".* FROM "qytetets"
SELECT "pozis".* FROM "pozis"

  def show
    @pcs = Pc.all
    @gjuhas = Gjuha.all
    @qytetets = Qytetet.all
    @pozi = Pozi.all
    @formularis= Formulari.find(params[:id])
    @status = Status.all
---
SELECT "gjuhas".* FROM "gjuhas"
SELECT "qytetets".* FROM "qytetets"
SELECT "pozis".* FROM "pozis"
SELECT  "formularis".* FROM "formularis" WHERE "formularis"."id" = ? LIMIT 1  [["id", 1]]
SELECT "statuses".* FROM "statuses"

  def edit
    @pcs = Pc.all
    @gjuhas = Gjuha.all
    @qytetets = Qytetet.all
    @pozi = Pozi.all
    @formularis = Formulari.find(params[:id])
---
SELECT "gjuhas".* FROM "gjuhas"
SELECT "qytetets".* FROM "qytetets"
SELECT "pozis".* FROM "pozis"
SELECT  "formularis".* FROM "formularis" WHERE "formularis"."id" = ? LIMIT 1  [["id", 1]]

    body = body + "<p style=\"font-weight: bold;\">Njohurit kompjuterike: #{@formulari.njohurit_kompjuterike}</p>"

    respond_to do |format|
      if @formulari.save
        User.all.each do |u|
---
INSERT INTO "formularis" ("pozi_id", "emri", "mbiemri", "ditelindja", "leternjoftimi", "tel", "email", "edukimi_from", "edukimi_institucioni", "edukimi_drejtimi", "edukimi_titulli", "eksperienca_from", "eksperienca_to", "eksperienca_kompania", "eksperienca_pozita", "gjuha_niveli", "qytetet_id", "adresa", "status_id", "ongoing", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users"

  def update


  # @form = Formulari.all
  #     @form.each do |f|
  #       if f.status_id == 2
  #         @punt = Punetori.create(:emri => f.emri)

  #       end
  #        end
    respond_to do |format|



      if @formulari.update(formulari_params)
         formulari_momental = Formulari.find(params[:id])
        if formulari_momental.status_id == 1

          FormulariMailer.njoftim_adaptivit(formulari_momental).deliver
        elsif formulari_momental.status_id == 2
          @punt = Punetori.new(:id => formulari_momental.id, :emri => formulari_momental.emri, :mbiemri => formulari_momental.mbiemri, :email=>formulari_momental.email)
          @punt.save
        FormulariMailer.njoftim_per_pune_adaptivit(formulari_momental).deliver
      elsif formulari_momental.status_id == 3
        @ref = Refuzuar.new(:id => formulari_momental.id,:pozi_id => formulari_momental.pozi_id, :emri => formulari_momental.emri, :mbiemri => formulari_momental.mbiemri, :status_id => formulari_momental.status_id, :ditelindja => formulari_momental.ditelindja, :vendlindja=>formulari_momental.vendlindja, :tel=>formulari_momental.tel, :email=>formulari_momental.email)
        @ref.save
        FormulariMailer.njoftim_per_pune(formulari_momental).deliver
      elsif formulari_momental.status_id == 4
        @inter = Interview.new(:pozi_id => formulari_momental.pozi_id, :emri => formulari_momental.emri, :mbiemri => formulari_momental.mbiemri, :status_id => formulari_momental.status_id, :ditelindja => formulari_momental.ditelindja, :vendlindja=>formulari_momental.vendlindja, :tel=>formulari_momental.tel, :email=>formulari_momental.email)
        @inter.save
---
UPDATE "formularis" SET "gjuha_niveli" = ?, "intervista" = ?, "testet" = ?, "status_id" = ?, "trajnimi_institucioni" = ?, "trajnimi_drejtimi" = ?, "updated_at" = ? WHERE "formularis"."id" = ?  [["gjuha_niveli", ""], ["intervista", ""], ["testet", ""], ["status_id", 2], ["trajnimi_institucioni", ""], ["trajnimi_drejtimi", ""], ["updated_at", "2016-06-01 12:31:17.806675"], ["id", 1]]
SELECT  "formularis".* FROM "formularis" WHERE "formularis"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "punetoris" ("id", "emri", "mbiemri", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", 2], ["emri", "Adriana"], ["mbiemri", "Caka"], ["email", "nushi_bana@hotmail.com"], ["created_at", "2016-06-01 12:31:46.160755"], ["updated_at", "2016-06-01 12:31:46.160755"]]
INSERT INTO "refuzuars" ("id", "emri", "mbiemri", "status_id", "tel", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "interviews" ("emri", "mbiemri", "status_id", "ditelindja", "tel", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)