app/controllers/gjuhas_controller.rb

SELECT "gjuhas".* FROM "gjuhas"
---
  def index
    @gjuhas = Gjuha.all

INSERT INTO "gjuhas" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Anglisht"], ["created_at", "2016-11-30 13:04:26.391257"], ["updated_at", "2016-11-30 13:04:26.391257"]]
---
  def create
    @gjuha = Gjuha.new(gjuha_params)

    respond_to do |format|
      if @gjuha.save

SELECT  "gjuhas".* FROM "gjuhas" WHERE "gjuhas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_gjuha
      @gjuha = Gjuha.find(params[:id])