app/controllers/interviews_controller.rb

  def index
    ab(params[:lan])
    @interviews = Interview.all
     @status = Status.all
     @pozi = Pozi.all
---
SELECT "interviews".* FROM "interviews"
SELECT "statuses".* FROM "statuses"
SELECT "pozis".* FROM "pozis"