app/controllers/kontrata_controller.rb

SELECT  "formularis".* FROM "formularis" WHERE "formularis"."id" = ? LIMIT 1  [["id", 2]]
SELECT "pozis".* FROM "pozis"
SELECT "qytetets".* FROM "qytetets"
---
  def new
    @punetori = Punetori.all
    @kontratum = Kontratum.new
    @formulari = Formulari.find(params[:kontrata_id])
    @status = Status.all
    @pozi = Pozi.all
    @qytetets= Qytetet.all

SELECT  "punetoris".* FROM "punetoris" WHERE "punetoris"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "punetoris" SET "statusi_kontrates" = ?, "updated_at" = ? WHERE "punetoris"."id" = ?  [["statusi_kontrates", "t"], ["updated_at", "2016-06-01 12:32:15.895680"], ["id", 2]]
---
  def create
    @kontratum = Kontratum.new(kontratum_params)
    respond_to do |format|
      if @kontratum.save
        @punt = Punetori.find(@kontratum.punetori_id)
        @punt.update(:statusi_kontrates => true)