app/controllers/pozis_controller.rb

  def index
    ab(params[:lan])
    @pozis = Pozi.all
---
SELECT "pozis".* FROM "pozis"

  def create
    @pozi = Pozi.new(pozi_params)

    respond_to do |format|
      if @pozi.save
---
INSERT INTO "pozis" ("description", "job_description", "skills", "about_compnay", "kodi", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @pozi.destroy
---
DELETE FROM "pozis" WHERE "pozis"."id" = ?  [["id", 1]]

    def set_pozi
      @pozi = Pozi.find(params[:id])
---
SELECT  "pozis".* FROM "pozis" WHERE "pozis"."id" = ? LIMIT 1  [["id", 1]]