app/controllers/punetoris_controller.rb

  def index
     @formulari = Formulari.all
    ab(params[:lan])
      @search = Punetori.search(params[:q])
---
SELECT "punetoris".* FROM "punetoris"

  def destroy
    @punetori.destroy
---
DELETE FROM "punetoris" WHERE "punetoris"."id" = ?  [["id", 2]]

    def set_punetori
      @punetori = Punetori.find(params[:id])
---
SELECT  "punetoris".* FROM "punetoris" WHERE "punetoris"."id" = ? LIMIT 1  [["id", 5]]