app/controllers/qytetets_controller.rb

  def index
    ab(params[:lan])
    @qytetets = Qytetet.all
---
SELECT "qytetets".* FROM "qytetets"

  def create
    @qytetet = Qytetet.new(qytetet_params)

    respond_to do |format|
      if @qytetet.save
---
INSERT INTO "qytetets" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Polluzhe"], ["created_at", "2016-11-09 15:45:44.280774"], ["updated_at", "2016-11-09 15:45:44.280774"]]

    def set_qytetet
      @qytetet = Qytetet.find(params[:id])
---
SELECT  "qytetets".* FROM "qytetets" WHERE "qytetets"."id" = ? LIMIT 1  [["id", 1]]