app/controllers/refuzuars_controller.rb

SELECT "refuzuars".* FROM "refuzuars"
SELECT "statuses".* FROM "statuses"
SELECT "pozis".* FROM "pozis"
---
  def index
    ab(params[:lan])
    @refuzuars = Refuzuar.all
     @status = Status.all
     @pozi = Pozi.all