app/controllers/statuses_controller.rb

  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Ne pritje"], ["created_at", "2016-06-01 12:30:49.717143"], ["updated_at", "2016-06-01 12:30:49.717143"]]